let fee = +prompt("Mời nhập số lương của bạn: " + "(Vui lòng không dùng dấu . hoặc , nhé khách iu)");
let total = 0;

if (fee > 0 && !isNaN(fee)) {
    if (fee <= 5000000) {
        total = fee * 0.05;
    } else if (fee <= 10000000) {
        total = (5000000*0.05) + ((fee-5000000) * 0.1);
    } else if (fee <= 18000000) {
        total = (5000000*0.05) + (5000000*0.1) + ((fee-10000000) *0.15);
    } else if (fee <= 32000000) {
        total = (5000000*0.05) + (5000000*0.1) + (8000000 *0.15) +((fee-18000000) * 0.2);
    } else if (fee <= 52000000) {
        total = (5000000*0.05) + (5000000*0.1) + (8000000 *0.15) +(14000000 * 0.2)+ ((fee-32000000) * 0.25);
    }else if (fee <= 80000000) {
        total = (5000000*0.05) + (5000000*0.1) + (8000000 *0.15) +(14000000 * 0.2)+ (20000000 * 0.25)+ ((fee-52000000) * 0.3);
    } else {
        total = (5000000*0.05) + (5000000*0.1) + (8000000 *0.15)+ (14000000 * 0.2)+ (20000000 * 0.25) +(28000000 * 0.3)+ ((fee-80000000) * 0.35);
    }

    alert("Tiền thuế cá nhân của bạn là: " + total.toLocaleString() + " VND");

} else {
    alert("Số tiền bạn nhập không hợp lệ.")
}


